[
    {
        "sumarize": "Software Engineer with expertise in Web development, Linux Administration Systems, Databases, Computer Networking, Parallel programing, HCI, IoT.",
        "education": [
            {
                "university": "University of Colima",
                "place": "Colima, Mexico",
                "degree": "B. in Software Engineering",
                "completition_date": "Expected Graduation: June 2021"
            },
            {
                "university": "International House",
                "place": "Guadalajara, Mexico",
                "degree": "Spanish Teacher as Foreign Language Certificate",
                "completition_date": "Completed: April 2015"
            },
            {
                "university": "Regina Apostolorum",
                "place": "Rome, Italy",
                "degree": "B. in Philosophy GPA: 3.9/4.0",
                "completition_date": "Graduated: June 2011"
            }
        ],
        "experience": [
            {
                "company": "Freelance",
                "place": "Colima, Mexico",
                "position": "Software Engineer",
                "date": "June 2020",
                "projects": [
                    {
                        "description": "Designed and developed a single-page website, so the company increased 75% its impact on the internet.",
                        "technologies": "ReactJS, Bootstrap, EmailJS, and Sass."
                    }
                ]
            },
            {
                "company": "University of Colima",
                "place": "Colima, Mexico",
                "position": "Support to the teaching staff of the Faculty of Telematics",
                "date": "Sept 2018 - Dec 2020",
                "projects": [
                    {
                        "description": "Developed a responsive website to register and purchase passes for a web development conference event",
                        "technologies": "HTML5, CSS3, JavaScript, jQuery, Ajax, AdminLTE, Mysql, PHP 7, Leaflet API, and Paypal API."
                    },
                    {
                        "description": "Designed and developed a responsive single-page website for the project MapMonedero Acumulapuntos for the company GHApps.",
                        "technologies": "HTML5, CSS3, and Bootstrap 4."
                    },
                    {
                        "description": "Developed 70’% of a web responsive information management system. It is consumed by the University of Colima Soccer Team App Lorofan that has 100+ downloads for Android. It has a CRUD for managing the game calendar, team, players, comments from users, news, and ads; it also has sessions by user profiles and encrypted passwords.",
                        "technologies": "HTML/CSS, Bootstrap 4, AdminLTE framework, JavaScript, jQuery, Ajax, PHP 7, MySQL, and MVC pattern."
                    }
                ]
            },
            {
                "company": "BKC-IH Moscow",
                "place": "Moscow, Russia",
                "position": "Spanish Teacher as Foreign Language",
                "date": "Sept 2015 – June 2016",
                "projects": [
                    {
                        "description": "Taught Spanish as a Foreign Language for general and business purposes.",
                        "technologies": ""
                    }
                ]
            },
            {
                "company": "Major Seminary Diocese of Colima",
                "place": "Colima, Mexico",
                "position": "Teacher of Philosophy and Humanities",
                "date": "Sept 2012 – Oct 2014",
                "projects": [
                    {
                        "description": "Taught courses of Philosophy, Scientific Research Methodology, and Humanities.",
                        "technologies": ""
                    }
                ]
            }
        ],
        "awards": [
            "Won the scholarship for academic excellence two terms in a row, by obtaining the highest grade among 65 Software Engineering students of the Faculty of Telematics.",
            "Won a national-wide scholarship from the Telmex Foundation in recognition of leadership and academic success; only 0.9% of 4.2 million students got it in 2018.",
            "Organized a swiss chess tournament for the students of the major seminary of the diocese of Colima, 23 students participated in and the local chess club “El Enroque” helped in the organization." 
        ]
    }
]